import axios from "axios";
import { httpService } from "../../../services/httpService";
import { useState } from "react";
import { getcategoreisService } from "../../../services/category";
import swal from "sweetalert";

export const headers = [
  "id",
  "عنوان",
  "توضیحات",
  "تاریخ",
  // "موجودی",
  // "تعداد لایک",
  // "وضعیت",
  // "عملیات",
];

export const handleGetCategoreis = async (setData) => {
  try {
    const res = await getcategoreisService();

    if (res.status == 200) {
      console.log(res.data.data);
      setData(res.data.data);
    } else {
      swal("خطا!", "مشکلی رخ داده است");
    }
  } catch {
    swal("خطا!", "مشکلی رخ داده است");
    console.log("error catch");
  }
};

// export const rows_data_productTable = [
//   {
//     id: 165,
//     title: "لوازم موبایل",
//     descriptions: "لوازم موبایل",
//     image: null,
//     logo: null,
//   },

//   {
//     id: 172,
//     title: "لوازم ورزشی",
//     descriptions: "لوازم ورزشی",
//     image: null,
//     logo: null,
//   },

//   {
//     id: 234,
//     title: "لوازم پزشکی",
//     descriptions: "لوازم پزشکی",
//     image: null,
//     logo: null,
//   },

//   {
//     id: 235,
//     title: "کیف و کوله",
//     descriptions: "کیف و کوله",
//     image: null,
//     logo: null,
//   },

//   {
//     id: 246,
//     title: "ابزارالات پزشکی",
//     descriptions: "ابزارالات پزشکی",
//     image: null,
//     logo: null,
//   },

//   {
//     id: 249,
//     title: "لوازم عکاسی",
//     descriptions: null,
//     image: null,
//     logo: null,
//   },
// ];

export const rows_data_productTable = [
  ["1", "فلان1", "محصول1", "20تومان", "100", "123", "فعال"],
  ["2", "فلان2", "محصول2", "20تومان", "100", "123", "فعال"],
  ["3", "فلان3", "محصول3", "20تومان", "100", "123", "فعال"],
  ["4", "فلان4", "محصول4", "20تومان", "100", "123", "فعال"],
  ["5", "فلان5", "محصول5", "20تومان", "100", "123", "فعال"],
  ["6", "فلان6", "محصول6", "20تومان", "100", "123", "فعال"],
  ["7", "فلان7", "محصول7", "20تومان", "100", "123", "فعال"],
  ["8", "فلان1", "محصول1", "20تومان", "100", "123", "فعال"],
  ["9", "فلان2", "محصول2", "20تومان", "100", "123", "فعال"],
  ["10", "فلان3", "محصول3", "20تومان", "100", "123", "فعال"],
  ["11", "فلان4", "محصول4", "20تومان", "100", "123", "فعال"],
  ["12", "فلان5", "محصول5", "20تومان", "100", "123", "فعال"],
  ["13", "فلان6", "محصول6", "20تومان", "100", "123", "فعال"],
  ["14", "فلان7", "محصول7", "20تومان", "100", "123", "فعال"],
  ["15", "فلان1", "محصول1", "20تومان", "100", "123", "فعال"],
  ["16", "فلان2", "محصول2", "20تومان", "100", "123", "فعال"],
  ["17", "فلان3", "محصول3", "20تومان", "100", "123", "فعال"],
  ["18", "فلان4", "محصول4", "20تومان", "100", "123", "فعال"],
  ["19", "فلان5", "محصول5", "20تومان", "100", "123", "فعال"],
  ["20", "فلان6", "محصول6", "20تومان", "100", "123", "فعال"],
  ["21", "فلان7", "محصول7", "20تومان", "100", "123", "فعال"],
];

// =========================================================

export const headers_colourTable = ["#", "نام رنگ", "کد رنگ", "رنگ", "عملیات"];

export const rows_data_colourTable = [
  ["1", "ابی", "aaa", "رنگ ابی"],
  ["2", "سبز", "aaa", "رنگ ابی"],
  ["3", "سفید", "aaa", "رنگ ابی"],
  ["4", "بنفش", "aaa", "رنگ ابی"],
  ["5", "صورتی", "aaa", "رنگ ابی"],
  ["6", "قرمز", "aaa", "رنگ ابی"],
  ["7", "قهوه ای", "aaa", "رنگ ابی"],
  ["8", "سیاه", "aaa", "رنگ ابی"],
];
